{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.16.0", "signature": {"inputs": {"MNET_INPUT": {"name": "mnet_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"MNET_CLASS_ACTIVATION": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6522"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_4/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_2_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_7/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_4_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_2/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/t", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/e", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/t", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/e", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_3/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "6522"}]}}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6522"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mnet_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice", "op": "StridedSlice", "input": ["mnet_input", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1", "op": "StridedSlice", "input": ["mnet_input", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2", "op": "StridedSlice", "input": ["mnet_input", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3", "op": "StridedSlice", "input": ["mnet_input", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4", "op": "StridedSlice", "input": ["mnet_input", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add", "op": "AddV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/sub", "op": "Sub", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Greater", "op": "Greater", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Less", "op": "Less", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Less/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/add", "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_2", "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_2_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_4", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/sub", "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_4_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/Greater", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/t", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/e"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1", "op": "SelectV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/Less", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/t", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/e"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_2", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_1/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_2", "op": "ExpandDims", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_4", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_2/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_9", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_1/x", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_4/x", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_7", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_7/x", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_3", "op": "ExpandDims", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_9", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_3/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_4", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_7", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin_1", "op": "Sin", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin_2", "op": "Sin", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_1", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_8", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_2", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sin_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Mul_10", "op": "Mul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_8", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_2", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_5", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Mul_10", "StatefulPartitionedCall/BirdNET/MNET_CONVERT/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/BirdNET/MNET_CONVERT/concat", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/Relu", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/Relu", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/Relu", "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/MatMul/ReadVariableOp", "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATION/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATION/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_1", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_4/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/add_2/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_2_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_3", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Sqrt_2", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/mul_7/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/sub/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_4_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_2/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/truediv_5", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Greater/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/t", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2/e", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/strided_slice_4/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/Less/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/t", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/SelectV2_1/e", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/ExpandDims_3/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CONVERT/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/MatMul/ReadVariableOp", "shape": [144, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/MatMul/ReadVariableOp", "shape": [256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/MatMul/ReadVariableOp", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/MatMul/ReadVariableOp", "shape": [1024, 6522], "dtype": "float32"}, {"name": "StatefulPartitionedCall/BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd/ReadVariableOp", "shape": [6522], "dtype": "float32"}]}]}